[
    {
      "year": "2023",
      "date": "Apr 2023 – Present",
      "location": "Surat, India",
      "position": "Sr Frontend Developer",
      "company": "NEXTNOUS",
      "responsibilities": [
        "Developed responsive websites using HTML5, CSS3, Less, Sass, and JavaScript, meeting project deadlines and client expectations.",
"Created advanced React.js websites with RESTful API integration for dynamic web applications.",
"Proficient in wireframing, UX/UI design, and prototyping for various devices.",
"Utilized Bootstrap for cross-browser compatibility and mobile responsiveness.",
"Customized Shopify e-commerce solutions for improved shopping experiences.",
"Maintained HTML standards for code consistency and industry best practices.",
"Managed WordPress websites for optimal performance and security.",
"Implemented new features and tested for functionality.",
"Developed Android web apps using React Native."
      ]
    },
    {
      "year": "2021",
      "date": "Apr 2021 – Mar 2022",
      "location": "Surat, India",
      "position": "Frontend web developer",
      "company": "Dynamic Dreamz",
      "responsibilities": [
        "Shopify Development: Expertise in Shopify Liquid and other technologies for high-quality e-commerce solutions.",
"jQuery Troubleshooting: Fixing jQuery issues in Shopify, enhancing site functionality and user experience.",
"Bootstrap Websites: Building responsive websites with Bootstrap for optimal user experience on various devices.",
"GTM Event Tracking: Developing and implementing GTM event tracking to enhance data visualization and decision-making.",
"Custom WordPress Sites: Designing and developing custom WordPress websites using HTML, CSS, and PHP.",
"jQuery Animations: Creating custom jQuery animations for engaging and visually appealing website experiences.",
"React Development: Proficiency in developing complex React applications with state management and context API.",
"PSD/XD/Figma to Code: Converting design files (PSD, XD, Figma) to HTML, CSS, and jQuery for business and user needs."
      ]
    },
    {
      "year": "2019",
      "date": "Apr 2019 – Mar 2021",
      "location": "Surat, India",
      "position": "Frontend web developer",
      "company": "Casepoint Pvt.Ltd.",
      "responsibilities": [
        "Utilized agile scrum methodology and TFS for eDiscovery product development with a focus on efficiency and timeliness.",
        "Enhanced eDiscovery product functionality and user experience using Kendo UI library.",
        "Ensured 508 accessibility compliance for inclusivity, utilizing jQuery and team collaboration.",
        "Designed and developed a dynamic website with Grav CMS, following best practices for web design and user experience.",
        "Collaborated across teams to ensure 508 compliance in the eDiscovery product, making it accessible to all.",
        "Stayed updated on industry trends and tech for continuous product and website improvement.",
        "Employed strong problem-solving skills to ensure project success on schedule.",
        "Demonstrated ability to work both independently and as part of a team."
      ]
    },
    {
      "year": "2018",
      "date": "May 2018 – Apr 2019",
      "location": "Surat, India",
      "position": "Web Designer",
      "company": "Ecreate Infotech",
      "responsibilities": [
        " Developed responsive, user-friendly websites with HTML5, CSS3, and other relevant tech.",
        " Proficient in designing, testing, and deploying website features promptly.",
        " Maintained HTML standards for consistency and compatibility.",
        " Leveraged Bootstrap for efficient responsive website creation.",
        " Managed WordPress sites, utilizing ACF for custom templates and fields.",
        " Redesigned websites with clean, efficient code and user-friendly design.",
        " Crafted application logos and banners to reflect brand identity.",
        " Designed mobile app interfaces with tools like Photoshop for optimal user experience.",
        " Implemented SEO best practices effectively."
      ]
    }
  ]
  